fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалистов/ВКМ_КалендарьСпециалистов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_КалендарьСпециалистов</name>
</mdclass:DataProcessor>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиента/ВКМ_ОбслуживаниеКлиента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиента</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеРаботы</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВыполненныеСотрудникомРаботы</registerRecords>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОканчанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполненныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплате</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/DataProcessors/ВКМ_КалендарьСпециалистов/Forms/Форма/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала = НачалоДня(ТекущаяДатаСеанса());
	Период.ДатаОкончания = КонецДня(ТекущаяДатаСеанса()+60*60*24*7);

	ОбновлениеЗагрузкаДанныхКалендаря();
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ОбновитьКалендарьСпециалиста"  Тогда 
		ОбновлениеЗагрузкаДанныхКалендаря(); 
	КонецЕсли;	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КалендарьПередСозданием(Элемент, Начало, Конец, ЗначенияИзмерений, Текст, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ВыделенныеЭлементыМассив = Новый Массив;
		
	ПараметрыВыбранных = Новый Структура;   
	ПараметрыВыбранных.Вставить("Ответственный", ЗначенияИзмерений["Специалист"]);
	ПараметрыВыбранных.Вставить("ДатаПроведенияРабот", НачалоДня(Начало));
	ПараметрыВыбранных.Вставить("ВремяНачалаРаботПлан", Начало);  
	ПараметрыВыбранных.Вставить("ВремяОканчанияРаботПлан",  Конец);  
		//
	ВыделенныеЭлементыМассив.Добавить(ПараметрыВыбранных);
		
		
	ЕстьПересечениеИнтервалов = ПересечениеИзмененныхИнтерваловПланировщика(ВыделенныеЭлементыМассив);
    	
	Если ЕстьПересечениеИнтервалов Тогда 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Есть пересечения временных интервалов!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕСли;	

	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.Форма.ФормаДокумента", ПараметрыВыбранных, ЭтотОбъект); 
	
КонецПроцедуры


&НаКлиенте
Процедура КалендарьПриОкончанииРедактирования(Элемент, НовыйЭлемент, ОтменаРедактирования)
		
	Если Элемент.ВыделенныеЭлементы.Количество() = 0 Тогда 
		ОтменаРедактирования = Истина;
		Возврат;
	КонецЕсли;	
	
	///1. Создаем массив данных для изменения (может быть выделено несколько элементов календаря)
			
	ВыделенныеЭлементыМассив = Новый Массив;
	
	Для Каждого ВыделенныйЭлемент Из Элемент.ВыделенныеЭлементы Цикл	
		СсылкаНаДокумент = ВыделенныйЭлемент.Значение;
		
		ПараметрыВыбранных = Новый Структура; 
		ПараметрыВыбранных.Вставить("Ключ", СсылкаНаДокумент);
	    ПараметрыВыбранных.Вставить("Ответственный", ВыделенныйЭлемент.ЗначенияИзмерений["Специалист"]);
	    ПараметрыВыбранных.Вставить("ДатаПроведенияРабот", НачалоДня(ВыделенныйЭлемент.Начало));
		ПараметрыВыбранных.Вставить("ВремяНачалаРаботПлан", ВыделенныйЭлемент.Начало);  
		ПараметрыВыбранных.Вставить("ВремяОканчанияРаботПлан",  ВыделенныйЭлемент.Конец);  
		ПараметрыВыбранных.Вставить("ИзменитьСуществующийДокумент",  Истина);
		
		//
		ВыделенныеЭлементыМассив.Добавить(ПараметрыВыбранных);
		
	КонецЦикла;
	
	//2. Запрос о пересечении интервалов

	ЕстьПересечениеИнтервалов = ПересечениеИзмененныхИнтерваловПланировщика(ВыделенныеЭлементыМассив);

	Если ЕстьПересечениеИнтервалов Тогда 
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Есть пересечения временных интервалов!";
			Сообщение.Сообщить();
			ОтменаРедактирования = Истина;
			Возврат;
	КонецЕСли;	

	//3. Для каждого интервала открываем форму с переданными параметрами
	Для Каждого ВыделенныйЭлемент Из ВыделенныеЭлементыМассив Цикл;  				
		ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.Форма.ФормаДокумента", ВыделенныйЭлемент);
	КонецЦикла;   
	
	
КонецПроцедуры


&НаКлиенте
Процедура КалендарьПередНачаломРедактирования(Элемент, НовыйЭлемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	
	Если Элемент.ВыделенныеЭлементы.Количество() = 0 Тогда 
		Возврат;
	КонецЕсли;
	
	СсылкаНаДокумент = Элемент.ВыделенныеЭлементы[0].Значение;
		
	ПараметрыОткрываемойФормы = Новый Структура;
    ПараметрыОткрываемойФормы.Вставить("Ключ", СсылкаНаДокумент);
	ОткрытьФорму("Документ.ВКМ_ОбслуживаниеКлиента.Форма.ФормаДокумента", ПараметрыОткрываемойФормы);
	
	

КонецПроцедуры


&НаКлиенте
Процедура КалендарьПередУдалением(Элемент, Отказ)
	
	Если Элемент.ВыделенныеЭлементы.Количество() = 0 Тогда 
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
			
	СсылкаНаДокумент = Элемент.ВыделенныеЭлементы[0].Значение;  
	ЗадатьВопросОПродолжении(СсылкаНаДокумент, Отказ);  
	
КонецПроцедуры  

 

#КонецОбласти

#Область   СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	ОбновлениеЗагрузкаДанныхКалендаря();
КонецПроцедуры

//Функция возвращает Выборку из Запроса
&НаСервере
Функция ВыбратьРасписаниеСпециалистов(НачалоПериода, КонецПериода)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка,
	               |	ВКМ_ОбслуживаниеКлиента.Ответственный КАК Специалист,
	               |	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	               |	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан КАК ВремяНачала,
	               |	ВКМ_ОбслуживаниеКлиента.ВремяОканчанияРаботПлан КАК ВремяОканчания,
	               |	ВКМ_ОбслуживаниеКлиента.Контрагент КАК Контрагент
	               |ИЗ
	               |	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	               |ГДЕ
	               |	НЕ ВКМ_ОбслуживаниеКлиента.ПометкаУдаления
	               |	И ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот МЕЖДУ &НачалоПериода И &КонецПериода";
		
	Запрос.Параметры.Вставить("НачалоПериода", НачалоПериода);
	Запрос.Параметры.Вставить("КонецПериода", КонецПериода);
	
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции


&НаСервере
Функция ЧислоСекундСНачалаДня(ДатаВремя)
	Возврат ДатаВремя - НачалоДня(ДатаВремя);
КонецФункции	


&НаСервере
Процедура  ОбновлениеЗагрузкаДанныхКалендаря()
	
	//Очищаем предыдуще данные
	Планировщик.ТекущиеПериодыОтображения.Очистить();
	Планировщик.Измерения.Очистить();
	Планировщик.Элементы.Очистить();
	//
	
	Планировщик.ШкалаВремени.Положение = ПоложениеШкалыВремени.Верх;	
	ПериодДатаНачала = НачалоДня(Период.ДатаНачала);
	ПериодДатаОкончания = КонецДня(Период.ДатаОкончания);
	
	Планировщик.НачалоПериодаОтображения = ПериодДатаНачала;
	Планировщик.КонецПериодаОтображения = ПериодДатаОкончания;
	
	Планировщик.ТекущиеПериодыОтображения.Добавить(ПериодДатаНачала, ПериодДатаОкончания);
	ИзмерениеСпециалист = Планировщик.Измерения.Добавить("Специалист");
	
	
	
	//*Добавляем пустой элемент с незаполненным измерением специалист 
	//В планировщике появится строка без заполненного специалита, нажав на которую
	//можно создать документ "Обслуживание клиента" и выбрать специалиста вручную (например, нового)
	ЭлементИзмерения = ИзмерениеСпециалист.Элементы.Добавить(Справочники.Пользователи.ПустаяСсылка());
	ЭлементИзмерения.Текст = "Выбрать специалиста";
	ЦветПустого = ЦветаСтиля.ДобавленныйРеквизитФон;
	ЭлементИзмерения.ЦветФона = ЦветПустого;
	Измерения = Новый Соответствие;
	Измерения.Вставить("Специалист", ЭлементИзмерения);
	//
	
	//По умолчанию, в планировщике выбираются и показываются данные сохраненных документов "Обслуживание клиента"
	//на 7 дней вперед, начиная с начала дня текущего. Поэтому, если в указанном периоде еще 
	//нет документов "Обслуживания" с каким-то специалистом, такой специалист не будет отображен в планировщике.
	//Что бы добавить новый документ и выбрать специалиста вручную, и нужна пустая строка*  
	Выборка = ВыбратьРасписаниеСпециалистов(Период.ДатаНачала, Период.ДатаОкончания);
	
	Пока Выборка.Следующий() Цикл
				
		НачалоПериода = НачалоДня(Выборка.ДатаПроведенияРабот)+ ЧислоСекундСНачалаДня(Выборка.ВремяНачала);
		КонецПериода = НачалоДня(Выборка.ДатаПроведенияРабот)+ ЧислоСекундСНачалаДня(Выборка.ВремяОканчания);
		
		ЭлементИзмерения = ИзмерениеСпециалист.Элементы.Найти(Выборка.Специалист);
		
		Если ЭлементИзмерения = Неопределено Тогда
			ЭлементИзмерения = ИзмерениеСпециалист.Элементы.Добавить(Выборка.Специалист); 
		КонецЕсли;	

			
		Измерения = Новый Соответствие;
		Измерения.Вставить("Специалист", Выборка.Специалист);
				
		Элемент = Планировщик.Элементы.Добавить(НачалоПериода,КонецПериода );
		Элемент.Значение = Выборка.Ссылка; //Ссылка на документ "Обслуживание клиента"
		Элемент.Текст = Выборка.Контрагент;
		Элемент.ЗначенияИзмерений = Новый ФиксированноеСоответствие(Измерения);            
		
	КонецЦикла;
		
КонецПроцедуры	

//Функция возвращает Ложь, если новый (или измененный) элемент не пересекается с другими элементами
//Или Истина - если такие пересечения есть
&НаСервере
Функция ПересечениеИзмененныхИнтерваловПланировщика(ПараметрыВыбранных)

//При создание нового интервала или перенесении интервала другому специалисту в общем случае области могут пересекаться
//Т.е возникнен ситуация, когда по документу "Обслуживание клиента" специалист должен будет находится у разных клиентов одновременно
//Запретим пересечение интервалов элементов при интерактивной работе в планировщике
    Отказ = Ложь;
	
	ТаблицаВыбранныхЭлементов = Новый ТаблицаЗначений; 
	ТаблицаВыбранныхЭлементов.Колонки.Добавить("СсылкаНаДокумент", Новый ОписаниеТипов("ДокументСсылка.ВКМ_ОбслуживаниеКлиента"));
	ТаблицаВыбранныхЭлементов.Колонки.Добавить("ВыбСпециалист", Новый ОписаниеТипов("СправочникСсылка.ВКМ_ФизическиеЛица"));
	ТаблицаВыбранныхЭлементов.Колонки.Добавить("ВыбДата", Новый ОписаниеТипов("Дата"));
    ТаблицаВыбранныхЭлементов.Колонки.Добавить("ВыбВремяНачала", Новый ОписаниеТипов("Дата")); 
	ТаблицаВыбранныхЭлементов.Колонки.Добавить("ВыбВремяОканчания", Новый ОписаниеТипов("Дата"));
	
	Для Каждого ВыделенныйЭлемент Из ПараметрыВыбранных Цикл    	
		
		НоваяСтрока = ТаблицаВыбранныхЭлементов.Добавить(); 
		
		Если ВыделенныйЭлемент.Свойство("Ключ") Тогда  
			НоваяСтрока.СсылкаНаДокумент = ВыделенныйЭлемент.Ключ;
		Иначе
			НоваяСтрока.СсылкаНаДокумент = Документы.ВКМ_ОбслуживаниеКлиента.ПустаяСсылка();
		КонецЕсли;
        		
		НоваяСтрока.ВыбСпециалист = ВыделенныйЭлемент.Ответственный;
		НоваяСтрока.ВыбДата =  НачалоДня(ВыделенныйЭлемент.ДатаПроведенияРабот);
		
		//В документе "Обслуживание клиента" время начала и окончания робот установлено в фомате
		//"время", т.е. нулевая дата + время. А в календаре  оно обозначается как ДатаПроведенияРабот+Время  
		ИзмВремяНачала = '00010101000000' +  (ВыделенныйЭлемент.ВремяНачалаРаботПлан - НачалоДня(ВыделенныйЭлемент.ВремяНачалаРаботПлан)); 
		ИзмВремяОканчания = '00010101000000' + (ВыделенныйЭлемент.ВремяОканчанияРаботПлан - НачалоДня(ВыделенныйЭлемент.ВремяОканчанияРаботПлан));
		
		//В запрос используется функция МЕЖДУ, которая  включает сравниваемые интервалы. Чтобы их не включать изменим время начала и конца на 1 секунду
		НоваяСтрока.ВыбВремяНачала =  ИзмВремяНачала+1;  
        НоваяСтрока.ВыбВремяОканчания =  ИзмВремяОканчания-1;			
	КонецЦикла;	

	Запрос = Новый Запрос; 	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТЗ.СсылкаНаДокумент КАК СсылкаНаДокумент,
	               |	ТЗ.ВыбСпециалист КАК ВыбСпециалист,
	               |	ТЗ.ВыбДата КАК ВыбДата,
	               |	ТЗ.ВыбВремяНачала КАК ВыбВремяНачала,
	               |	ТЗ.ВыбВремяОканчания КАК ВыбВремяОканчания
	               |ПОМЕСТИТЬ ВТ_ВыбранныеЭлементы
	               |ИЗ
	               |	&ТЗ КАК ТЗ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВыбранныеЭлементы.СсылкаНаДокумент КАК СсылкаНаДокумент,
	               |	ВТ_ВыбранныеЭлементы.ВыбСпециалист КАК ВыбСпециалист,
	               |	ВТ_ВыбранныеЭлементы.ВыбДата КАК ВыбДата,
	               |	ВТ_ВыбранныеЭлементы.ВыбВремяНачала КАК ВыбВремяНачала,
	               |	ВТ_ВыбранныеЭлементы.ВыбВремяОканчания КАК ВыбВремяОканчания
	               |ИЗ
	               |	ВТ_ВыбранныеЭлементы КАК ВТ_ВыбранныеЭлементы
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	               |		ПО ВТ_ВыбранныеЭлементы.СсылкаНаДокумент <> ВКМ_ОбслуживаниеКлиента.Ссылка
	               |			И ВТ_ВыбранныеЭлементы.ВыбСпециалист = ВКМ_ОбслуживаниеКлиента.Ответственный
	               |			И (ВТ_ВыбранныеЭлементы.ВыбДата = НАЧАЛОПЕРИОДА(ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот, ДЕНЬ))
	               |			И (ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан МЕЖДУ ВТ_ВыбранныеЭлементы.ВыбВремяНачала И ВТ_ВыбранныеЭлементы.ВыбВремяОканчания
	               |				ИЛИ ВКМ_ОбслуживаниеКлиента.ВремяОканчанияРаботПлан МЕЖДУ ВТ_ВыбранныеЭлементы.ВыбВремяНачала И ВТ_ВыбранныеЭлементы.ВыбВремяОканчания
	               |				ИЛИ ВКМ_ОбслуживаниеКлиента.ВремяНачалаРаботПлан < ВТ_ВыбранныеЭлементы.ВыбВремяНачала
	               |					И ВКМ_ОбслуживаниеКлиента.ВремяОканчанияРаботПлан > ВТ_ВыбранныеЭлементы.ВыбВремяОканчания)
	               |ГДЕ
	               |	НЕ ВКМ_ОбслуживаниеКлиента.ПометкаУдаления";
	
	
	
	Запрос.Параметры.Вставить("ТЗ", ТаблицаВыбранныхЭлементов);
		
	Выборка = Запрос.Выполнить().Выбрать();

	Если Выборка.Количество() > 0 Тогда 
		Отказ = Истина;
	КонецЕсли;	
	
	Возврат Отказ;
КонецФункции	



&НаКлиенте
 Асинх Процедура ЗадатьВопросОПродолжении(СсылкаНаДокумент, Отказ)
	ТекстВопроса = СтрШаблон("Вы уверены что хотите пометить документ %1 на удаление?", СсылкаНаДокумент);
	Ответ =  Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, 10, , "Удаление"); 
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ПометитьДокументНаУдаление(СсылкаНаДокумент); 
	Иначе
		Отказ = Истина;
	КонецЕсли;	
КонецПроцедуры


&НаСервере
Процедура ПометитьДокументНаУдаление(СсылкаНаДокумент) 
	
	ДокОбъект = СсылкаНаДокумент.ПолучитьОбъект();
	ДокОбъект.ПометкаУдаления = Истина;
	ДокОбъект.Записать();
	
КонецПроцедуры


#КонецОбласти
